In [27]:
import pandas as pd
import numpy as np 
import re

In [285]:
df = pd.read_excel('Book1.xlsx')

In [286]:
df.isnull().sum()

Изготовитель    0
dtype: int64

In [287]:
df = df.drop_duplicates()

In [288]:
df.index = range(1,430)
df.head()

                Изготовитель
1          "МаноТом" г.Томск
2  "Теплоприбор" г.Челябинск
3                      РОСМА
4       "Тизприбор" г.Москва
5             ОАО "Манотомь"

In [296]:
test = pd.DataFrame()

In [297]:
l = []
for i in df.Изготовитель:
    qlist = re.findall('\s*"([^\"]*)"',i)
    s = str(qlist)
    if s != '[]':
        temp_data = pd.DataFrame({'Изготовитель':[s[2:-2].lower()]})
    else:
        temp_data = pd.DataFrame({'Изготовитель':[0]})
    test = test.append(temp_data)

In [298]:
test.index  = range(1,430)

In [300]:
test

            Изготовитель
1                манотом
2            теплоприбор
3                      0
4              тизприбор
5               манотомь
..                   ...
425                    0
426                    0
427        энерготехника
428                 нпф
429  самарский трансформ

[429 rows x 1 columns]

In [301]:
test.query('Изготовитель == 0').index

Int64Index([  3,  10,  12,  14,  15,  16,  18,  21,  26,  27,
            ...
            404, 413, 414, 416, 417, 418, 421, 423, 425, 426],
           dtype='int64', length=162)

In [302]:
test2 = pd.DataFrame()
for i in test.query('Изготовитель == 0').index:
    test2 = test2.append([df.Изготовитель[i].lower()])

In [303]:
test2.columns = ['Изготовитель']

In [304]:
test2= test2.drop_duplicates()

In [305]:
test1 = test.drop_duplicates()

In [306]:
test1

            Изготовитель
1                манотом
2            теплоприбор
3                      0
4              тизприбор
5               манотомь
..                   ...
415           завод №423
419               сигнур
420                 акип
427        энерготехника
429  самарский трансформ

[172 rows x 1 columns]

In [307]:
test2

                Изготовитель
0                      росма
0   логика г.санкт-петербург
0                        зип
0                       чэаз
0                   г.москва
..                       ...
0                        тмз
0                     метrеl
0                        эип
0                 оао №мцбк"
0             эндресс+хаузер

[161 rows x 1 columns]

In [308]:
new_df = pd.concat([test1, test2])

In [309]:
new_df.index = range(1,334)

In [310]:
new_df = new_df.drop(3,axis=0)

In [311]:
new_df[new_df.Изготовитель.str.match(r'г. ')].index

Int64Index([207, 221, 236, 238, 261, 264, 282, 286, 321], dtype='int64')

In [312]:
new_df[new_df.Изготовитель.str.match(r'г.')].index

Int64Index([ 73,  83, 109, 112, 155, 162, 177, 205, 207, 209, 210, 211, 219,
            220, 221, 222, 224, 229, 232, 233, 234, 236, 237, 238, 239, 240,
            247, 248, 249, 252, 259, 260, 261, 262, 263, 264, 281, 282, 286,
            296, 306, 315, 316, 317, 318, 319, 320, 321, 327],
           dtype='int64')

In [313]:
new_df = new_df.drop([207, 221, 236, 238, 261, 264, 282, 286, 321,73,  83, 109, 112, 155, 162, 177, 205, 207, 209, 210, 211, 219,
            220, 221, 222, 224, 229, 232, 233, 234, 236, 237, 238, 239, 240,
            247, 248, 249, 252, 259, 260, 261, 262, 263, 264, 281, 282, 286,
            296, 306, 315, 316, 317, 318, 319, 320, 321, 327],axis=0)

In [314]:
new_df.shape

(283, 1)

In [315]:
new_df.to_excel("Список изготовителей.xlsx")